openfoam/3_channel_step/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-0.5 0 0)
    (-0.5 0.5 0)
    (0 -0.5 0)
    (0 0 0)
    (0 0.5 0)
    (4.5 -0.5 0)
    (4.5 0 0)
    (4.5 0.5 0)

    (-0.5 0 0.1)
    (-0.5 0.5 0.1)
    (0 -0.5 0.1)
    (0 0 0.1)
    (0 0.5 0.1)
    (4.5 -0.5 0.1)
    (4.5 0 0.1)
    (4.5 0.5 0.1)
);

blocks
(
    hex (0 3 4 1 8 11 12 9)
    (20 20 1)
    simpleGrading (1 1 1)

    hex (3 6 7 4 11 14 15 12)
    (200 20 1)
    edgeGrading (1 1 1)

    hex (2 5 6 3 10 13 14 11)
    (200 20 1)
    edgeGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 1 9 8)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (6 7 15 14)
            (5 6 14 13)
        );
    }
    upperWall
    {
        type wall;
        faces
        (
            (1 4 12 9)
            (4 7 15 12)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 3 11 8)
            (3 2 10 11)
            (2 5 13 10)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 4 1)
            (3 6 7 4)
            (2 5 6 3)
            (8 11 12 9)
            (11 14 15 12)
            (10 13 14 11)
        );
    }
);


// ************************************************************************* //
